#include<stdio.h>
#include<string.h>
int main(){
	int n = 0;
while (n++<=2);  printf("%d\n", n);
int a=4, b=1, c;
	c = a > 5 ? 1 : 2,
	c=b < 4 ? 3 : 4;
	printf("%d\n", c);
printf("%d%c",strlen("\01"),1); 
}
C语言中运算符优先级排序如下：
分为优先级15级：
1、圆括号【（）】、下标运算符【[]】、分量运算符的指向结构体成员运算符【->】、结构体成员运算符【.】；
2、逻辑非运算符【!】、按位取反运算符【~】、自增自减运算符【++】【 --】、负号运算符【-】、类型转换运算符【(类型)】、指针运算符和取地址运算符【*】【&】、长度运算符【sizeof】；
3、乘法运算符【*】、除法运算符【/】、取余运算符【%】；
4、加法运算符【+】、减法运算符【-】；
5、左移动运算符【<<】、右移动运算符【>>】；
6、关系运算符【< 】【>】【<=】【 >= 】；
7、等于运算符【==】、不等于运算符【!=】；
8、按位与运算符【&】；
9、按位异或运算符【^】；
10、按位或运算符【|】；
11、逻辑与运算符【&&】；
12、逻辑或运算符【||】；
13、条件运算符【?:】；
14、赋值运算符【=】【/=】【*=】【%=】【+=】【-=】【<<=】【>>=】【&=】【^=】【|=】；
15、逗号运算符【,】。

